[
  {
    "url": "https://www.cci.health.wa.gov.au/Resources/Looking-After-Yourself",
    "source": "cci_australia",
    "title": "CCI - Self Help Resources for Mental Health Problems",
    "content": "Looking After Yourself\nSelf Help Resources for Mental Health Problems\nIf you experience a condition that is affecting your mental health and are looking for specific information about different types of problems then the ‘workbooks' or sets of modules in this section may be relevant to you.  Some of the modules can be used on their own, while others are best used as part of the series; each workbook will have its own suggestions. We strongly encourage you to talk to your local doctor or a mental health professional about your difficulties as the information provided in the resources are NOT a substitute for proper diagnosis or treatment by an appropriate health professional.\nFor many of the problems listed below, there are also brief information sheets, along with a series of worksheets that you may wish to use, or that your therapist may help you with.\nPlease refer to the\ndisclaimer\nbefore making use of these resources.\nAnxiety\nAssertiveness\nAppearance Concerns\nBipolar\nBody Dysmorphia\nDepression\nDisordered Eating\nHealth Anxiety\nPanic\nPerfectionism\nProcrastination\nSelf-Compassion\nSelf-Esteem\nSleep\nSocial Anxiety\nTolerating Distress\nWorry and Rumination\nOther Resources\n(audio files and phone apps)\nLast Updated:\n16/01/2024\nAlso in this section\nOverview\n{74035F8D-632C-4A56-9863-012015F4679D}\nLooking After Yourself\n{0403180E-42C9-4A3F-A5A9-2C70C1AD00E8}\nLooking After Others\n{CF57F18B-F088-4BB8-B7F3-80E52B7AC29C}\nFor Clinicians\n{4359E14E-A412-4B30-97A6-E7D2B3ACDF96}",
    "headings": [
      {
        "level": 1,
        "text": "Looking After Yourself"
      },
      {
        "level": 1,
        "text": "Looking After Yourself"
      },
      {
        "level": 2,
        "text": "Self Help Resources for Mental Health Problems"
      },
      {
        "level": 2,
        "text": "Contact us"
      },
      {
        "level": 2,
        "text": "Address"
      }
    ],
    "collected_at": 1753218856.62047,
    "word_count": 209
  },
  {
    "url": "https://www.cci.health.wa.gov.au/Treatment/Overview",
    "source": "cci_australia",
    "title": "CCI Anxiety, Depression, Bipolar & Eating Disorders Treatment - Perth",
    "content": "Overview\nThe Centre for Clinical Interventions (CCI) provides specialised, evidence-based treatment for anxiety, depression, bipolar disorder, and eating disorders at our clinic in Perth, Western Australia.\nTreatment Programs\nWe offer the following group treatment programs:\nMood Management Course\nfor managing depression and anxiety\nSocial Anxiety Course\nfor social anxiety disorder (social phobia)\nWorry and Rumination Course\nfor repetitive negative thinking – a common problem in generalized anxiety disorder, depression, and other mental health problems\nBipolar Course\nfor bipolar disorder (manic-depression)\nPanic Disorder Course\nfor panic disorder\nWe offer the following family-based treatment programs:\nFamily-based therapy\n(FBT) for adolescents (16-18 years) with Anorexia Nervosa\nWe offer\nindividual psychological therapy\nfor:\nDepressive disorders (major depression and persistent depressive disorder)\nBipolar disorder\nAnxiety and related disorders (panic disorder, agoraphobia, generalised anxiety disorder, social anxiety disorder, specific phobias, body dysmorphic disorder, and health anxiety  -- which is also sometimes called hypochondriasis, somatic symptom disorder, or illness anxiety disorder)\nEating disorders\n(binge eating disorder, bulimia nervosa, anorexia nervosa, ARFID, and other specified feeding or eating disorders)\nOur Treatment Philosophy\nCCI offers short-term treatments which aim to equip people with practical skills and strategies to manage their psychological difficulties. An average course of treatment lasts around 10 treatment sessions (although this may be longer in the case of eating disorders) and sessions tend to be scheduled once a week.\nCognitive-behaviour therapy (CBT) is the primary psychological treatment offered at our service, as there is a robust evidence-base to support the effectiveness of this intervention for a broad range of mental health problems. CBT can teach you strategies to modify unhelpful thoughts (cognitions) and behaviours. To learn more about CBT, we recommend reading\nthis article\nby CCI Senior Clinical Psychologist Dr Peter McEvoy.\nOur treatments are delivered by clinical psychologists who have specialist, postgraduate university training in psychological assessment and therapy.  Our team has years of experience treating depression, bipolar, anxiety, and eating disorders.  We are passionate about making treatments that have been shown to be effective in scientific research freely available to the public at our clinic in Perth.\nOur team also routinely evaluate the effectiveness of the treatments we offer, and use research to improve them, so that we can help more people to overcome their mental health difficulties. For the past two decades our service has been at the forefront of improving psychological treatments for mental disorders.  For example, we were the first clinic in the world to be trained in enhanced Cognitive Behaviour Therapy (CBT-E) for eating disorders, developed at Oxford University.  We have also developed enhancements for CBT for social anxiety at our clinic that have now been proven to help more people overcome their social anxiety, when compared to standard treatments.\nWho Can Receive Treatment\nOur treatment programs are available to adults age 18 years and over who are residents of Western Australia and have a Medicare card (or age 16 and over in the case of eating disorders).\nCost of Treatment\nAs we form part of the public health service, the treatment that we offer is free.\nReferrals\nIf you are interested in coming to treatment at CCI, you can be\nreferred\nto our service by your GP or psychiatrist. If you are unable to attend our service, you may find it helpful to explore our free self-help\nresources\non this website.\nMore Information\nFor more information about accessing treatment at CCI, please see our service information brochure:\nClick here to view our service information brochure online\nClick here for a tri-fold brochure (designed to be printed and folded)\nLast Updated:\n14/04/2025\nAlso in this section\nOverview\n{3B8CEAEA-75FD-4911-B697-32D8032A64BA}\nMood Management Course\n{E5043A33-376E-48C6-A012-F54669333AF9}\nBipolar Course\n{69206959-9FFB-4746-92B8-5448BA0F4292}\nSocial Anxiety Course\n{E4BEFFA4-2B4E-40DC-8F66-72575A3B384F}\nWorry and Rumination Course\n{ACB4A6E1-C189-4A04-902E-2742B1912790}\nPanic Disorder Course\n{2F7BFCEB-20D3-41EA-967E-C1A8E88A3B79}\nEating Disorders Program\n{74E3C78C-2CFF-461C-A6E7-E11E3BADB13D}\nIndividual Treatment\n{638D4634-C3A2-43C0-A1A9-139697646D54}\nReferrals\n{CEEADE79-E4ED-4F5C-845F-D39ED38BD37F}\nProgram Brochures\n{5BD5F4C2-63BD-4B71-93CD-40A09CCD298F}",
    "headings": [
      {
        "level": 1,
        "text": "Overview"
      },
      {
        "level": 1,
        "text": "Overview"
      },
      {
        "level": 3,
        "text": "Treatment Programs"
      },
      {
        "level": 3,
        "text": "Our Treatment Philosophy"
      },
      {
        "level": 3,
        "text": "Who Can Receive Treatment"
      },
      {
        "level": 3,
        "text": "Cost of Treatment"
      },
      {
        "level": 3,
        "text": "Referrals"
      },
      {
        "level": 3,
        "text": "More Information"
      },
      {
        "level": 2,
        "text": "Contact us"
      },
      {
        "level": 2,
        "text": "Address"
      }
    ],
    "collected_at": 1753218859.527605,
    "word_count": 630
  },
  {
    "url": "https://www.cci.health.wa.gov.au/Treatment/Mood-Management-Course",
    "source": "cci_australia",
    "title": "Depression & Anxiety Treatment | Perth",
    "content": "Mood Management Course\nThe CCI Mood Management Course (MMC) is a structured group treatment focused on equipping you with practical skills and strategies to manage both depression and anxiety. Whilst there are some differences between depression and anxiety, they also share a lot of overlap. Many people experience both moods together. Both depression and anxiety share common symptoms and patterns of thinking, and there are important similarities in the techniques that you can learn to manage both moods.\nThe Mood Management Course is a group treatment program focused on breaking the vicious cycles of anxiety and depression by addressing the key unhelpful thinking styles and behaviours that keep anxiety and depression going. The course includes:\nEducation about depression and anxiety.\nIdentifying activities that give a sense of pleasure or achievement, and working to include these in regular routines.\nLearning to break down overwhelming tasks into manageable steps.\nCognitive therapy (identifying, questioning and changing unhelpful thoughts).\nLearning how to actively cope with problems.\nEach MMC runs for 10 weekly sessions of 2 hours, with a follow-up session 4 weeks after the 10th session; groups are run periodically throughout the year. All appointments take place during normal business hours (Monday-Friday, 9am-5pm). The MMC is run by clinical psychologists and held at our clinic in\nPerth, Western Australia\n.  As CCI forms part of the public mental health system, the service we offer is free. There is typically a waiting list for our service, which can be several months. If you are interested in attending the MMC at CCI, please ask your GP or psychiatrist to\nrefer you\nto our service.\nFor more information, see our Mood Management Course brochure:\nClick here to view our Mood Management Course brochure online\nClick here for a tri-fold brochure (designed to be printed and folded)\nFrequently Used Worksheets - Mood Management Course\nWeekly Activity Record\nBehavioural Antidepressants\nGraded tasks and Graded exposure Worksheet\nThought Diary\nDisputation Questions List\nActive Coping Worksheet\nLast Updated:\n07/06/2023\nAlso in this section\nOverview\n{3B8CEAEA-75FD-4911-B697-32D8032A64BA}\nMood Management Course\n{E5043A33-376E-48C6-A012-F54669333AF9}\nBipolar Course\n{69206959-9FFB-4746-92B8-5448BA0F4292}\nSocial Anxiety Course\n{E4BEFFA4-2B4E-40DC-8F66-72575A3B384F}\nWorry and Rumination Course\n{ACB4A6E1-C189-4A04-902E-2742B1912790}\nPanic Disorder Course\n{2F7BFCEB-20D3-41EA-967E-C1A8E88A3B79}\nEating Disorders Program\n{74E3C78C-2CFF-461C-A6E7-E11E3BADB13D}\nIndividual Treatment\n{638D4634-C3A2-43C0-A1A9-139697646D54}\nReferrals\n{CEEADE79-E4ED-4F5C-845F-D39ED38BD37F}\nProgram Brochures\n{5BD5F4C2-63BD-4B71-93CD-40A09CCD298F}",
    "headings": [
      {
        "level": 1,
        "text": "Mood Management Course"
      },
      {
        "level": 1,
        "text": "Mood Management Course"
      },
      {
        "level": 2,
        "text": "Contact us"
      },
      {
        "level": 2,
        "text": "Address"
      }
    ],
    "collected_at": 1753218862.4860032,
    "word_count": 366
  },
  {
    "url": "https://www.cci.health.wa.gov.au/Treatment/Bipolar-Course",
    "source": "cci_australia",
    "title": "CCI Bipolar Disorder Group Cognitive-Behaviour Treatment (CBT) - Perth",
    "content": "Bipolar Course\nThere can be many difficult and stressful aspects of having Bipolar Disorder that are not addressed by medical treatment. We offer the CCI Bipolar Course to equip people with knowledge and skills to help them manage Bipolar Disorder in combination with their medication. Research indicates that group psychological treatment can be a helpful addition to medication.\nThe CCI Bipolar Course is a structured group treatment focused on equipping you with practical skills and strategies to manage Bipolar Disorder. This includes:\nEducation about Bipolar Disorder\nLearning to monitor mood and sleep to help predict mood changes\nA pharmacist providing general information about medications and answering questions\nLearning to identify and respond to early warning signs of mood changes\nIdentifying activities that give a sense of pleasure or achievement, and working to include these\nin regular routines\nLearning to break down overwhelming tasks into manageable steps\nCognitive therapy (identifying, challenging and replacing unhelpful thoughts)\nLearning how to actively cope with problems.\nEach Bipolar Course runs for 10 weekly sessions of two hours, with a follow-up session one month after the tenth session; groups are run periodically throughout the year. All appointments take place during normal business hours (Monday-Friday, 9am-5pm). The Bipolar Course is run by clinical psychologists and is held at our clinic in\nPerth, Western Australia\n. As CCI forms part of the public mental health system, the service we offer is free. There is typically a waiting list for our service, which can be several months. If you are interested in attending the Bipolar Course at CCI, please ask your GP or psychiatrist to\nrefer you\nto our service.\nFor more information, see our Bipolar Course brochure:\nClick here to view our Bipolar Course brochure online\nClick here for a tri-fold brochure (designed to be printed and folded)\nPlease note that referrals to this course must be made by a psychiatrist.\nBipolar Disorder Support + Skill Building Group for Family and Friends\nThe Centre for Clinical Interventions (CCI) offers a free two-part group for carers, family members, and/or friends of people with bipolar disorder. These interactive groups are designed to provide information about bipolar disorder in addition to giving participants the opportunity to share their personal experiences and to learn helpful strategies for coping with their loved ones bipolar disorder. Whether you are a parent, sibling, partner, extended family member, friend, housemate, or child of a person with bipolar disorder, this group will be relevant for you.\nThe groups will be held at regular intervals throughout the year at the CCI office in Northbridge. Topics to be discussed include:\nWhat is bipolar disorder? – symptoms, and diagnosis\nWhat causes bipolar disorder: the Stress Vulnerability Model\nTreatment options and common issues\nPutting together a Plan of Action: Recognising and responding to early warning signs of mania and depression\nTaking care of yourself – acknowledging natural reactions and some useful coping strategies\nMaintaining relationships and helpful communication skills\nGroups run for 2.5 hours in the early evening and will be held on the same day across two consecutive weeks.\nTo register please phone 9227 4399 or email info.cci@health.wa.gov.au. Groups are ongoing,\nplease enquire for dates\n.\nFor more information, see our Information for Carers brochure:\nClick here to view our Information for Carers brochure online\nClick here for a tri-fold brochure (designed to be printed and folded)\nFrequently Used Worksheets - Bipolar Course\nAction Plan\nMood Monitoring Chart\nMy Thought Diary\nSleep Chart\nWeekly Activity Record\nLast Updated:\n08/04/2021\nAlso in this section\nOverview\n{3B8CEAEA-75FD-4911-B697-32D8032A64BA}\nMood Management Course\n{E5043A33-376E-48C6-A012-F54669333AF9}\nBipolar Course\n{69206959-9FFB-4746-92B8-5448BA0F4292}\nSocial Anxiety Course\n{E4BEFFA4-2B4E-40DC-8F66-72575A3B384F}\nWorry and Rumination Course\n{ACB4A6E1-C189-4A04-902E-2742B1912790}\nPanic Disorder Course\n{2F7BFCEB-20D3-41EA-967E-C1A8E88A3B79}\nEating Disorders Program\n{74E3C78C-2CFF-461C-A6E7-E11E3BADB13D}\nIndividual Treatment\n{638D4634-C3A2-43C0-A1A9-139697646D54}\nReferrals\n{CEEADE79-E4ED-4F5C-845F-D39ED38BD37F}\nProgram Brochures\n{5BD5F4C2-63BD-4B71-93CD-40A09CCD298F}",
    "headings": [
      {
        "level": 1,
        "text": "Bipolar Course"
      },
      {
        "level": 1,
        "text": "Bipolar Course"
      },
      {
        "level": 3,
        "text": "Bipolar Disorder Support + Skill Building Group for Family and Friends"
      },
      {
        "level": 2,
        "text": "Contact us"
      },
      {
        "level": 2,
        "text": "Address"
      }
    ],
    "collected_at": 1753218865.6721675,
    "word_count": 617
  },
  {
    "url": "https://www.cci.health.wa.gov.au/Treatment/Social-Anxiety-Course",
    "source": "cci_australia",
    "title": "Social Anxiety Treatment | Perth",
    "content": "Social Anxiety Course\nThe CCI Social Anxiety Course is a structured group treatment focused on equipping you with practical skills and strategies to overcome social anxiety. Our treatment uses cognitive behavioural therapy (CBT). CBT is based on the concept that our emotions and actions are largely influenced by our thoughts. Research has shown that people tend to think unhelpful thoughts when they are feeling socially anxious. CBT can teach you techniques and strategies to modify unhelpful thoughts and behaviours so that you can better manage your social anxiety.\nEducation about social anxiety\nCognitive therapy (identifying, questioning and changing unhelpful thoughts)\nExposure therapy (devising a plan for gradually approaching feared situations)\nAttention training (being more able to take in what is happening around us)\nDeveloping a realistic self-image of how we appear to others when we are anxious.\nEach Social Anxiety Course runs for 12 weekly sessions of 2 hours, with a follow-up session 4 weeks after the 12th session; groups are run periodically throughout the year. All appointments take place during normal business hours (Monday-Friday, 9am-5pm). The Social Anxiety Course is run by clinical psychologists and is held at our clinic in\nPerth, Western Australia\n. As CCI forms part of the public mental health system, the service we offer is free. There is typically a waiting list for our service, which can be several months. If you are interested in attending the Social Anxiety Course at CCI, please ask your GP or psychiatrist to\nrefer you\nto our service.\nFor more information, see our Social Anxiety Course brochure:\nClick here to view our Social Anxiety Course brochure online\nClick here for a tri-fold brochure (designed to be printed and folded)\nFrequently Used Worksheets - Social Anxiety Course\nImagery Challenging Record\nBehavioural Experiment Record 1\nBehavioural Experiment Record Form 2\nBehavioural Experiment Record Form 3\nLast Updated:\n08/04/2021\nAlso in this section\nOverview\n{3B8CEAEA-75FD-4911-B697-32D8032A64BA}\nMood Management Course\n{E5043A33-376E-48C6-A012-F54669333AF9}\nBipolar Course\n{69206959-9FFB-4746-92B8-5448BA0F4292}\nSocial Anxiety Course\n{E4BEFFA4-2B4E-40DC-8F66-72575A3B384F}\nWorry and Rumination Course\n{ACB4A6E1-C189-4A04-902E-2742B1912790}\nPanic Disorder Course\n{2F7BFCEB-20D3-41EA-967E-C1A8E88A3B79}\nEating Disorders Program\n{74E3C78C-2CFF-461C-A6E7-E11E3BADB13D}\nIndividual Treatment\n{638D4634-C3A2-43C0-A1A9-139697646D54}\nReferrals\n{CEEADE79-E4ED-4F5C-845F-D39ED38BD37F}\nProgram Brochures\n{5BD5F4C2-63BD-4B71-93CD-40A09CCD298F}",
    "headings": [
      {
        "level": 1,
        "text": "Social Anxiety Course"
      },
      {
        "level": 1,
        "text": "Social Anxiety Course"
      },
      {
        "level": 2,
        "text": "Contact us"
      },
      {
        "level": 2,
        "text": "Address"
      }
    ],
    "collected_at": 1753218868.5754445,
    "word_count": 346
  }
]